In [24]:
import numpy as np

In [2]:
import pandas as pd

df = pd.read_csv(r'C:\Users\Downloads\dummy.csv')

In [6]:
df

   no1   no2   no3
0    1   2.0  25.0
1    2   NaN   NaN
2    3   4.0   NaN
3    4   NaN  65.0
4    5   6.0   6.0
5    6   8.0   5.0
6    7   NaN   6.0
7    8  10.0   5.0
8    9   NaN   6.0
9   10  12.0   5.0

In [4]:
missing = df.isna().sum()

In [ ]:
missing

# Filling Null  with values

In [17]:
for col in df.columns:
    if df[col].dtype == 'object':
        df[col].fillna(df[col].mode()[0], inplace=True)  # mode()[0] to get the first mode value

    elif df[col].dtype == 'float64' or df[col].dtype == 'int64':
        df[col].fillna(df[col].mean(), inplace=True) #avg values adding for na cell

    else:
        print("Unsupported data type in column:", col)
print('done')

done

In [18]:
df

   no1   no2     no3
0    1   2.0  25.000
1    2   7.0  15.375
2    3   4.0  15.375
3    4   7.0  65.000
4    5   6.0   6.000
5    6   8.0   5.000
6    7   7.0   6.000
7    8  10.0   5.000
8    9   7.0   6.000
9   10  12.0   5.000

In [20]:
df.drop([1,5]) # by index remove

   no1   no2     no3
0    1   2.0  25.000
2    3   4.0  15.375
3    4   7.0  65.000
4    5   6.0   6.000
6    7   7.0   6.000
7    8  10.0   5.000
8    9   7.0   6.000
9   10  12.0   5.000

In [21]:
df.multiply(5)

   no1   no2      no3
0    5  10.0  125.000
1   10  35.0   76.875
2   15  20.0   76.875
3   20  35.0  325.000
4   25  30.0   30.000
5   30  40.0   25.000
6   35  35.0   30.000
7   40  50.0   25.000
8   45  35.0   30.000
9   50  60.0   25.000

In [22]:
df.add(10)

   no1   no2     no3
0   11  12.0  35.000
1   12  17.0  25.375
2   13  14.0  25.375
3   14  17.0  75.000
4   15  16.0  16.000
5   16  18.0  15.000
6   17  17.0  16.000
7   18  20.0  15.000
8   19  17.0  16.000
9   20  22.0  15.000

In [59]:
df.no2[:4] = np.NaN # making null values to do practice

In [60]:
df.head()

   no1  no2  no3
4  5.0  NaN  6.0
5  6.0  NaN  5.0
6  7.0  NaN  6.0
7  8.0  NaN  5.0
8  9.0  7.0  6.0

## drop null values

In [55]:
#first check how manu na values are there
total_na = df.isna().sum()
total_na

no1    4
no2    5
no3    4
dtype: int64

In [63]:
# drop na values by rows with column name 
drop_na = df.dropna(subset=['no1'] ,axis=0 ,inplace=True)
df

    no1  no2  no3
4   5.0  NaN  6.0
5   6.0  NaN  5.0
6   7.0  NaN  6.0
7   8.0  NaN  5.0
8   9.0  7.0  6.0
9  10.0  NaN  5.0

# create new df

In [16]:
#this time work with real large dataset
import pandas as pd 
import numpy as np

df = pd.read_csv(r"E:\Datasets\salary_data.csv")

In [17]:
#check dataframe
df.head()

,Position,State,Sex,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,Accountant I,NaN,F,Married,US Citizen,Active,Admin Offices,674.28,NaN,Black or African American
1,Accountant I,MA,M,Divorced,US Citizen,Active,Admin Offices,674.28,50.0,Black or African American
2,Accountant I,MA,M,Single,NaN,Active,Admin Offices,674.28,43.0,White
3,Administrative Assistant,MA,F,NaN,US Citizen,Terminated for Cause,Admin Offices,47822.00,44.0,NaN
4,NaN,MA,F,Single,US Citizen,Active,Admin Offices,NaN,33.0,White

In [18]:
#check last data
df.tail()

,Position,State,Sex,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
305,Sr. Network Engineer,CT,F,Married,US Citizen,Leave of Absence,IT/IS,NaN,38.0,White
306,Sr. Network Engineer,MA,M,Married,US Citizen,Leave of Absence,IT/IS,27603.00,34.0,White
307,NaN,MA,M,Married,US Citizen,Future Start,IT/IS,27587.46,24.0,Asian
308,Sr. Network Engineer,CT,M,NaN,US Citizen,Active,IT/IS,12126.53,31.0,White
309,Sr. Network Engineer,MA,F,Widowed,US Citizen,Active,IT/IS,37257.00,46.0,Asian

In [20]:
#lets check dtypes 
df.dtypes

Position             object
State                object
Sex                  object
MaritalDesc          object
CitizenDesc          object
EmploymentStatus     object
Department           object
Salaries            float64
age                 float64
Race                 object
dtype: object

In [19]:
df.isna().sum()

Position            43
State               35
Sex                 34
MaritalDesc         29
CitizenDesc         27
EmploymentStatus    32
Department          18
Salaries            32
age                 35
Race                25
dtype: int64

# finding and fill null values using pandas

In [21]:
#lets check first mode in object dtype
mode_value = df.Position.mode()[0]
mode_value

'Production Technician I'

In [26]:
df.Position.replace(np.NaN ,mode_value ,inplace =True)

In [27]:
df.isna().sum()

Position             0
State               35
Sex                 34
MaritalDesc         29
CitizenDesc         27
EmploymentStatus    32
Department          18
Salaries            32
age                 35
Race                25
dtype: int64

In [34]:
#for numeric columns we use mean or median 
df.select_dtypes(include ='number').head()

   Salaries   age
0    674.28   NaN
1    674.28  50.0
2    674.28  43.0
3  47822.00  44.0
4       NaN  33.0

In [35]:
df.Salaries.max()

108304.0

In [36]:
df.Salaries.min()

75.0

In [37]:
df.Salaries.mean()

36725.39600719424

In [38]:
df.Salaries.tail()

305         NaN
306    27603.00
307    27587.46
308    12126.53
309    37257.00
Name: Salaries, dtype: float64

In [39]:
df.Salaries.median()

35568.315

In [41]:
df.select_dtypes(include='number').isna().sum()

Salaries    32
age         35
dtype: int64

In [47]:
for num_col in df.select_dtypes(include='number'):
    median_data = df[num_col].median()
    df[num_col].replace(np.NaN ,mode_data ,inplace=True)
print("Work Done")

Work Done

In [45]:
df.select_dtypes(include='number').isna().sum()

Salaries    0
age         0
dtype: int64

In [46]:
df.isna().sum()

Position             0
State               35
Sex                 34
MaritalDesc         29
CitizenDesc         27
EmploymentStatus    32
Department          18
Salaries             0
age                  0
Race                25
dtype: int64

In [58]:
#lets fill na values remaing catogorical variables
for i in df.select_dtypes(exclude ='number'):
    mode_values = df[i].mode()[0]
    df[i].replace(np.nan ,mode_value , inplace=True)
print('Done Job')

Done Job

In [57]:
df.isna().sum()

Position            0
State               0
Sex                 0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

In [61]:
df.dtypes

Position             object
State                object
Sex                  object
MaritalDesc          object
CitizenDesc          object
EmploymentStatus     object
Department           object
Salaries            float64
age                 float64
Race                 object
dtype: object

In [62]:
df.age =df.age.astype('object')

In [63]:
df.dtypes

Position             object
State                object
Sex                  object
MaritalDesc          object
CitizenDesc          object
EmploymentStatus     object
Department           object
Salaries            float64
age                  object
Race                 object
dtype: object